src/cf/Catalogs/ШаблоныНаименований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныНаименований</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНаименования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаименованийОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекурсивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляПредставления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДляФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ТоварВнеБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ор_ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ор_РеквизитыДляЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ШаблоныНаименованийПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ШаблоныНаименованийКатегории(Категория, ДляХарактеристики) Экспорт
	
	Если ДляХарактеристики Тогда
		Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегорииДляХарактеристики(Категория);
	Иначе
		Шаблоны = ШаблоныНаименованийПовтИсп.ШаблоныНаименованийКатегорииДляНоменклатуры(Категория);
	КонецЕсли;
	
	Возврат Шаблоны;
	
КонецФункции

Функция ПолучитьШаблонДляВидаНаименования(КатегорияНоменклатуры, ВидНаименования) Экспорт
	
	НаборЗаписей = РегистрыСведений.ШаблоныНаименований.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КатегорияНоменклатуры.Установить(КатегорияНоменклатуры);
	НаборЗаписей.Отбор.ВидНаименования.Установить(ВидНаименования);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		Запись = НаборЗаписей.Получить(0);
		Возврат Запись.Шаблон;
	Иначе
		Возврат Справочники.ШаблоныНаименований.ПустаяСсылка()
	КонецЕсли;
	
КонецФункции


Функция ШаблоныНаименованийДоговоровКонтрагентов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныНаименований.Ссылка КАК Ссылка,
	|	ШаблоныНаименований.ШаблонДляФормирования КАК ШаблонДляФормирования,
	|	ШаблоныНаименований.ВидНаименования КАК ВидНаименования,
	|	ШаблоныНаименований.Рекурсивный КАК Рекурсивный,
	|	ВЫБОР
	|		КОГДА ШаблонНаименованияДоговоров.Значение ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПРИОРИТЕТ
	|ИЗ
	|	Справочник.ШаблоныНаименований КАК ШаблоныНаименований
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ШаблонНаименованияДоговоров КАК ШаблонНаименованияДоговоров
	|		ПО (ШаблонНаименованияДоговоров.Значение = ШаблоныНаименований.Ссылка)
	|ГДЕ
	|	ШаблоныНаименований.ВидНаименования = &ВидНаименования
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПРИОРИТЕТ,
	|	ШаблоныНаименований.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("ВидНаименования", Перечисления.ВидыНаименованийОбъектов.ДоговорКонтрагента);
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	Возврат Шаблоны;
	
КонецФункции

#Область ОтраслевыеПроцедурыИФункции

// Таблица шаблонов наименований категории по отборам.
//
// Параметры:
//  Категория		 - СправочникСсылка.КатегорииНоменклатуры	 - владелец шаблонов.
//  СтруктураОтборов - Структура	 - структура отборов, со свойствами:
//      - ВидНаименования;
//      - ДляХарактеристики;
//      - НаборСвойств;
//      - ТоварВнеБазы.
// 
// Возвращаемое значение:
//   - Массив.
//
Функция ШаблоныНаименованийКатегорииПоОтборам(Категория, СтруктураОтборов) Экспорт
	
	ДляХарактеристики = Ложь;
	Если СтруктураОтборов.Свойство("ДляХарактеристики") Тогда
		ДляХарактеристики = СтруктураОтборов.ДляХарактеристики;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныНаименований.Ссылка,
	|	ШаблоныНаименований.ШаблонДляФормирования,
	|	ШаблоныНаименований.ВидНаименования,
	|	ШаблоныНаименований.ДляХарактеристики,
	|	ШаблоныНаименований.Рекурсивный
	|ИЗ
	|	Справочник.ШаблоныНаименований КАК ШаблоныНаименований
	|ГДЕ
	|	ШаблоныНаименований.КатегорияНоменклатуры = &Категория";
	
	Если СтруктураОтборов.Свойство("ВидНаименования") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ШаблоныНаименований.ВидНаименования В (&ВидыНаименования)";
		МассивВидов = Новый Массив;
		МассивВидов.Добавить(Перечисления.ВидыНаименованийОбъектов.ПустаяСсылка());
		МассивВидов.Добавить(СтруктураОтборов.ВидНаименования);
		Запрос.УстановитьПараметр("ВидыНаименования", МассивВидов);
		
		ДляХарактеристики = СтруктураОтборов.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаРабочее
				Или СтруктураОтборов.ВидНаименования = Перечисления.ВидыНаименованийОбъектов.ХарактеристикаДляПечати;
		
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("НаборСвойств") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ШаблоныНаименований.НаборСвойств = &НаборСвойств";
		Запрос.УстановитьПараметр("НаборСвойств", СтруктураОтборов.НаборСвойств);
	КонецЕсли;
	
	Если ДляХарактеристики Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ШаблоныНаименований.ДляХарактеристики = &ДляХарактеристики";
		Запрос.УстановитьПараметр("ДляХарактеристики", ДляХарактеристики);
	КонецЕсли;
	
	Если СтруктураОтборов.Свойство("ТоварВнеБазы") Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ШаблоныНаименований.ор_ТоварВнеБазы = &ТоварВнеБазы";
		Запрос.УстановитьПараметр("ТоварВнеБазы", СтруктураОтборов.ТоварВнеБазы);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныНаименований.РеквизитДопУпорядочивания";
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	Возврат Шаблоны;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШаблоныНаименованийКатегорииДляНоменклатуры(Категория) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныНаименований.Ссылка,
	|	ШаблоныНаименований.ШаблонДляФормирования,
	|	ШаблоныНаименований.ВидНаименования,
	|	ШаблоныНаименований.ДляХарактеристики,
	|	ШаблоныНаименований.Рекурсивный
	|ИЗ
	|	Справочник.ШаблоныНаименований КАК ШаблоныНаименований
	|ГДЕ
	|	ШаблоныНаименований.КатегорияНоменклатуры = &Категория
	|	И ШаблоныНаименований.ДляХарактеристики = &ДляХарактеристики
	|	И НЕ ШаблоныНаименований.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныНаименований.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("ДляХарактеристики", Ложь);
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	Возврат Шаблоны;
	
КонецФункции

Функция ШаблоныНаименованийКатегорииДляХарактеристики(Категория) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныНаименований.Ссылка,
	|	ШаблоныНаименований.ШаблонДляФормирования,
	|	ШаблоныНаименований.ВидНаименования,
	|	ШаблоныНаименований.ДляХарактеристики,
	|	ШаблоныНаименований.Рекурсивный
	|ИЗ
	|	Справочник.ШаблоныНаименований КАК ШаблоныНаименований
	|ГДЕ
	|	ШаблоныНаименований.КатегорияНоменклатуры = &Категория
	|	И ШаблоныНаименований.ДляХарактеристики = &ДляХарактеристики
	|	И НЕ ШаблоныНаименований.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныНаименований.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("ДляХарактеристики", Истина);
	
	Шаблоны = Запрос.Выполнить().Выгрузить();
	Возврат Шаблоны;
	
КонецФункции

#КонецОбласти
